In [1]:
import pandas  as pd
import numpy as np

In [2]:
data = {
    'EmpID':[101,102,103,104,105,106,107,108] , 
    'EmpName':['Raman','Shyam','Mohan','Rohan','Ravi','Yogesh','Riya','Siya'],
    'EmpSalary':[23455,76555,26754,68765,64656,35556,78765,47645]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df.shape

(8, 3)

In [5]:
df

   EmpID EmpName  EmpSalary
0    101   Raman      23455
1    102   Shyam      76555
2    103   Mohan      26754
3    104   Rohan      68765
4    105    Ravi      64656
5    106  Yogesh      35556
6    107    Riya      78765
7    108    Siya      47645

In [6]:
data = {
    'EmpID':[101,102,103,104,105,106,107,108] , 
    'EmpName':['Raman','Shyam','Mohan',np.nan,'Ravi','Yogesh','Riya','Siya'],
    'EmpSalary':[23455,76555,np.nan,68765,64656,35556,np.nan,47645]
}

In [7]:
df = pd.DataFrame(data)

In [8]:
df

   EmpID EmpName  EmpSalary
0    101   Raman    23455.0
1    102   Shyam    76555.0
2    103   Mohan        NaN
3    104     NaN    68765.0
4    105    Ravi    64656.0
5    106  Yogesh    35556.0
6    107    Riya        NaN
7    108    Siya    47645.0

In [9]:
df.isnull()

   EmpID  EmpName  EmpSalary
0  False    False      False
1  False    False      False
2  False    False       True
3  False     True      False
4  False    False      False
5  False    False      False
6  False    False       True
7  False    False      False

In [10]:
df.isnull().sum()

EmpID        0
EmpName      1
EmpSalary    2
dtype: int64

In [11]:
df.isnull().sum().sum()

np.int64(3)

In [12]:
print( df.isnull().sum().sum() )

3

In [16]:
# Remove All Null Values
df.dropna()

   EmpID EmpName  EmpSalary
0    101   Raman    23455.0
1    102   Shyam    76555.0
4    105    Ravi    64656.0
5    106  Yogesh    35556.0
7    108    Siya    47645.0

In [20]:
# replace missing value with a dummy value
newdf = df.fillna(value='Missing')

In [21]:
newdf

   EmpID  EmpName EmpSalary
0    101    Raman   23455.0
1    102    Shyam   76555.0
2    103    Mohan   Missing
3    104  Missing   68765.0
4    105     Ravi   64656.0
5    106   Yogesh   35556.0
6    107     Riya   Missing
7    108     Siya   47645.0

In [22]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   EmpID      8 non-null      int64
 1   EmpName    8 non-null      object
 2   EmpSalary  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

In [23]:
df

   EmpID EmpName  EmpSalary
0    101   Raman    23455.0
1    102   Shyam    76555.0
2    103   Mohan        NaN
3    104     NaN    68765.0
4    105    Ravi    64656.0
5    106  Yogesh    35556.0
6    107    Riya        NaN
7    108    Siya    47645.0

In [25]:
newdf = df.copy()

In [26]:
newdf

   EmpID EmpName  EmpSalary
0    101   Raman    23455.0
1    102   Shyam    76555.0
2    103   Mohan        NaN
3    104     NaN    68765.0
4    105    Ravi    64656.0
5    106  Yogesh    35556.0
6    107    Riya        NaN
7    108    Siya    47645.0

In [27]:
newdf['EmpName'] = newdf['EmpName'].fillna('Missing')

In [28]:
newdf

   EmpID  EmpName  EmpSalary
0    101    Raman    23455.0
1    102    Shyam    76555.0
2    103    Mohan        NaN
3    104  Missing    68765.0
4    105     Ravi    64656.0
5    106   Yogesh    35556.0
6    107     Riya        NaN
7    108     Siya    47645.0

In [31]:
newdf['EmpSalary'] = newdf['EmpSalary'].fillna( value = df['EmpSalary'].mean() )

In [32]:
newdf

   EmpID  EmpName  EmpSalary
0    101    Raman    23455.0
1    102    Shyam    76555.0
2    103    Mohan    52772.0
3    104  Missing    68765.0
4    105     Ravi    64656.0
5    106   Yogesh    35556.0
6    107     Riya    52772.0
7    108     Siya    47645.0

In [37]:
data = {
    'EmpID':[101,102,103,104,105,106,107,108] , 
    'EmpName':['Raman','Shyam','Mohan',np.nan,'Ravi','Yogesh','Riya','Siya'],
    'EmpSalary':[23455,76555,np.nan,68765,64656,35556,np.nan,47645]
}

In [38]:
df = pd.DataFrame(data)

In [39]:
df

   EmpID EmpName  EmpSalary
0    101   Raman    23455.0
1    102   Shyam    76555.0
2    103   Mohan        NaN
3    104     NaN    68765.0
4    105    Ravi    64656.0
5    106  Yogesh    35556.0
6    107    Riya        NaN
7    108    Siya    47645.0

In [40]:
df.isnull().sum()

EmpID        0
EmpName      1
EmpSalary    2
dtype: int64

In [41]:
df.dropna()

   EmpID EmpName  EmpSalary
0    101   Raman    23455.0
1    102   Shyam    76555.0
4    105    Ravi    64656.0
5    106  Yogesh    35556.0
7    108    Siya    47645.0

In [42]:
df.fillna( 'missing' )

   EmpID  EmpName EmpSalary
0    101    Raman   23455.0
1    102    Shyam   76555.0
2    103    Mohan   missing
3    104  missing   68765.0
4    105     Ravi   64656.0
5    106   Yogesh   35556.0
6    107     Riya   missing
7    108     Siya   47645.0

In [43]:
newdf = df.copy()

In [44]:
newdf

   EmpID EmpName  EmpSalary
0    101   Raman    23455.0
1    102   Shyam    76555.0
2    103   Mohan        NaN
3    104     NaN    68765.0
4    105    Ravi    64656.0
5    106  Yogesh    35556.0
6    107    Riya        NaN
7    108    Siya    47645.0

In [45]:
newdf['EmpName'] = newdf['EmpName'].fillna('missing')

In [46]:
newdf

   EmpID  EmpName  EmpSalary
0    101    Raman    23455.0
1    102    Shyam    76555.0
2    103    Mohan        NaN
3    104  missing    68765.0
4    105     Ravi    64656.0
5    106   Yogesh    35556.0
6    107     Riya        NaN
7    108     Siya    47645.0

In [47]:
newdf['EmpSalary']=newdf['EmpSalary'].fillna( df['EmpSalary'].mean() )

In [48]:
newdf

   EmpID  EmpName  EmpSalary
0    101    Raman    23455.0
1    102    Shyam    76555.0
2    103    Mohan    52772.0
3    104  missing    68765.0
4    105     Ravi    64656.0
5    106   Yogesh    35556.0
6    107     Riya    52772.0
7    108     Siya    47645.0